import { Faq } from "./types";

export const FILTER_ACTIONS = {
  SET_NAME: "SET_NAME",
  SET_GENRE: "SET_GENRE",
  SET_CINEMA: "SET_CINEMA",
};

export const initialFilterState = {
  name: "",
  genre: "",
  cinema: "",
};

export const GENRES = [
  { id: "fantasy", name: "Фэнтези" },
  { id: "horror", name: "Хоррор" },
  { id: "action", name: "Экшен" },
  { id: "comedy", name: "Комедия" },
];

export const faq: Faq[] = [
  {
    id: 1,
    title: "Что такое Билетопоиск?",
    text: "Мы — крупнейший сервис о кино в рунете. На нем вы сможете посмотреть фильмы и сериалы, купить билеты в кино, узнать рейтинги популярных видео и интересные факты, поставить фильмам оценки, написать рецензии и дополнить описание фильмов.",
  },
  {
    id: 2,
    title: "Какой компании принадлежит Билетопоиск?",
    text: "Сайт был создан 7 ноября 2003 года, его основатели — Виталий Таций и Дмитрий Суханов. Владельцем проекта являлась компания ООО «Билетопоиск», которой принадлежало 60 % акций проекта, 40 % акций принадлежало её совладельцу — французской компании ООО AlloCiné. 15 октября 2013 года сервис купила компания «Яндекс» (размер сделки — $80 млн, около 2,6 млрд рублей на то время).",
  },
  {
    id: 3,
    title: "Как купить билет на Билетопоиск?",
    text: "Чтобы купить билет на Билетопоиск, необходимо воспользоваться функцией поиска кинотеатров и фильмов и выбрать нужный фильм. Далее, нужно выбрать необходимое количество билетов, перейти в корзину и произвести оплату билетов.",
  },
  {
    id: 4,
    title: "Как оставить отзыв на Билетопоиск?",
    text: "Чтобы оставить отзыв на Билетопоиск, нужно найти интересующий вас фильм или сериал, перейти на его страницу и нажать кнопку Написать отзыв, ввести текст отзыва и выбрать рейтинг фильма. После этого нужно нажать кнопку Опубликовать и ваш отзыв появится на странице фильма.",
  },
];
